# შემოგვაქვს რეგექსი 
import re
#შემოგვაქვს ტექსტი სრულად
text = "ჩვენი გუნდის წევრები არიან: saba.ananidze@itstep.com, მეგობარი დიმა dima123@gmail.com და კიდევ ერთი ტესტური მისამართი test_user@yahoo.com"
# ვიყენებთ რეფაინდოლს და საწყისი ასოდან ბოლომდე ასევე სასვენი ნიშნების გამოყენებით ვეძებთ მეილებს ტექსტში
mail_list = re.findall(r"[a-z-,.-_-A-Z]+@+[a-z-,.-_-A-Z]+", text)
#გამოგვაქვს მეილების ლისტი ჯოინის მეშეობით +ებით
mails = "+".join(mail_list)
#აქ გამოგვაქვს საბოლოო შედეგი.
print("იმეილების დაზუსტება")
print(mails)

