#მომხმარებელს ვთხოვთ შეიყვანოს შეკვეთის მოთხოვნა
user_input = input("გთხოვთ დააფიქსირეთ შეკვეთის მოთხოვნა: \n")
#შეყვანილი შეკვეთიდან რეფაინდოლით ვიღებთ რიცხვებს 
import re 
numbers = re.findall(r"\d+", user_input)
#ბილეთის ფასი არის ფიქსირებული 15 ლარი. 
ticket_price = 15
#ამოღებული რიცხვებიდან ინდექსაციის მეშვეობით გამოიყოფა ბილეტის რაოდენობა და ფასი.
#Try-ს შემოტანა აქ აუცილებელია რადგან იწყება რისკიანი ოპერაციები, სადაც შესაძლოა მოხდეს შეცდომები
try:
    tickets_count = int(numbers [0])
    ticket_amount = float(numbers [1])
    total_cost = float(tickets_count*ticket_price)
#აქ ვიწყებთ პირობის შემოტანას რომ ბილეთების რაოდენობა უნდა იყოს მინიმუმ 1 iF და პირდაპირ raise ფუნქციით
    if tickets_count <=0:
        raise ValueError("ბილეთების რაოდენობა უნდა იყოს მინიმუმ 1")
#აქ შემომაქვს პირობა, რომ შემოტანილი თანხა არ უნდა იყოს ჯამურ ღირებულებაზე ნაკლები
    if ticket_amount < total_cost:
        raise ZeroDivisionError("თანხა არ არის საკმარისი ! ")
#აქ შემომსაქვს ექსეფთ ბლოკი იმ შემთხვევაში თუ TRYმ ვერ იმუშავა და მომხმარებელმა არასწორად მიუთითა თანხა ან/და ტექსტის ტიპი იყო მთლიანად არასწორი. შემომაქვს შეცდომის ორი ვარიანტი.
except IndexError:
    print("შეცდომა ! - ტექსტში რიცხვები ვერ მოიძებნა")
except ValueError:
    print("ERROR ! - შეყვანილი ტექსტის ტიპი არასწორია, გთხოვ შეიყვანოთ ტექსტი მოთხოვნილი სტრუქტურის მიხედვით")
except ZeroDivisionError as err:
    print(f"[შეცდომა]: {err}" )
# აქ უკვე შემომსაქვს შეკვეთის წარმატებით განხორციელების შემდეგ დასაბრუნებელი ხურდის მოცულობა და ცნობები შეკვეთის წარმატებით დასრულების შესახებ. 
else:
    refund = float(ticket_amount-(tickets_count*ticket_price))
    print("ბილეთების რაოდენობა:  ", tickets_count)
    print(f"ბილეთის ფასი: {ticket_price:.2f} GEL")
    print(f"შემოტანილი თანხა:  {ticket_amount:.2f} GEL")
    print(f"გდასახდელი თანხა: {total_cost:.2f} GEL")
    print(f"დასაბრუნებელი თანხა:, {refund:.2f} GEL")
#ნებისმიერ შემთხვევაშ დაიბეჭდება რომ ტრანზაქცია დასრულდა. 
finally:
    print("\n [სისტემა]: ტრანზაქციის მცდელობა დასრულდა.")

    










#print(tickets_count,tickets_cost)
#print(numbers)