#შემომაქვს  ლისტი სადაც ეტაპობრივად დავამატებ შემდეგშ შეყვანილ ქულებს
scores_list = []
#ამ ფუნქციას ვიყენებ იმიტომ, რომ სტოპის შეყვანამდე იმუშაოს დაუსრულებლად, მათშორის შეცდომის შემთხვევაშც გააგრძელოს მუშაობა
while True:
    #რეფლეისით სფეისებს ამოვრიცხავ.
    scores_input = input("შეიყვანეთ ქულა ან ('stop'): ").replace(" ", "")
    #ყველა ასოს ზომა იქნება პატარა, რადგან სტოპის შემთხვევაში უნდა შეჩერდეს სისტემაში ციფრების შეყვანა
    if scores_input.lower() == "stop":
        break
    #აქედან უნდა დაიწყოს რისკიანი ოპერაციები.
    try:
        score = int(scores_input) 
        #ამ საკითხზე გამიჭირდა ძალიან ინდივიდუალური მუშაობა და დამჭირდა AI -ის დახმარება ლოგიკურად მივხვდი აქ რას ვაკეთებთ.(იგულისხმება NOT ის გამოყენება)
        if not (0 <= score <= 10):
            raise ValueError("გაფრთხილება!!! ქულა უნდა იყოს 0-დან 10-მდე დიაპაზონში.")
        scores_list.append(score)
    except ValueError as err:
        print("გთხოვთ მიუთითოთ შესაბამისი ციფრი - ", err)
        #აქ დაჯამდება დაგროვილი ქულები არსებული სახით სორიტრების გარეშე. 
print("დაგროვილი ქულები:", scores_list)
#ლენს აქ ვიყენებ იმიტომ რომ საწყისში სტოპი რომ შევიყვანოთ სხვა მონაცემებს არ დააჯამებს
if len (scores_list) > 0:
    #აქ მაქსიმუმი ქულები, მინიმუმი, და საშუალო გამომყავს ეს მარტივად გავიარე, ასევე რაოდენობა
    sort_scores = sorted(scores_list)
    sum_scores = sum(scores_list)
    score_counts = len(scores_list)
    max_score = sort_scores[-1]
    min_score = sort_scores[0]
    average_score = float(sum_scores/score_counts)
    print(f"ქულები ზრდადობის მიხედვით:", sort_scores)
    print(f"ქულების ჯამი: {sum_scores:.2f}")
    print(f"მაქსიმალური ქულა: {max_score:.2f}")
    print(f"მინიმალური ქულა:  {min_score:.2f}")
    print(f"კლასის საშუალო ქულა: {average_score:.2f}")
# ეს იყო კოდის ყველაზე რთული ნაწილი და დამჭირდა AI-ს დახმარება, არ ვარ დარწმუნებული, რომ ბოლომდე კარგად გავიგე საჭიროა ბევრი პრაქტიკული მუშაოება, ანუ მჭირდება ერთნაირი რიცხვების დაგენერირება და გავდივარ უნიკალური რიცხვებით. 
# აქ ვქმნით უნიკალური ქულების სიას, set score listi შლის დუბლიკატებს, ლისტით ისევ ჩვეულებრივ სიად აბრუნებს, დასორტირებით ზრდადობით ვალაგებთ.
unique_scores = sorted(list(set(scores_list)))
# თითოეულ გამეორებაზე S ცვლადია და იღებს თითო უნიკალურ ქულას, 
for s in unique_scores:
    #score_list count ეძებს S ეძებს მთლიან სიაში და გვანახებს რამდენჯერ ხვდება ლისტში
    count = scores_list.count(s)
    #შედეგი გამოდის საბოლოოდ.
    print(f"ქულა {s} გამეორდა {count}-ჯერ")
   
   

